---
kind: property
id: P:Autodesk.Revit.UI.RevitCommandId.CanHaveBinding
source: html/bb942b67-bcc5-3bf7-1e99-2b707b366f8e.htm
---
# Autodesk.Revit.UI.RevitCommandId.CanHaveBinding Property

Indicates whether the command can be assigned a binding to an external add-in.

## Syntax (C#)
```csharp
public bool CanHaveBinding { get; }
```